Revit 2027 API
DividedPath.Create(Document, IList<Reference>, ICollection<ElementId>) Method
 Creates a new instance of a divided path whose points are determined by the intersecting elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DividedPath Create(
	Document document,
	IList<Reference> curveReferences,
	ICollection<ElementId> intersectors
)
Public Shared Function Create (
	document As Document,
	curveReferences As IList(Of Reference),
	intersectors As ICollection(Of ElementId)
) As DividedPath
public:
static DividedPath^ Create(
	Document^ document,
	IList<Reference^>^ curveReferences,
	ICollection<ElementId^>^ intersectors
)
static member Create :
        document : Document *
        curveReferences : IList<Reference> *
        intersectors : ICollection<ElementId> -> DividedPath
Parameters
document Document
 The document.
curveReferences IList<Reference>
 References that represent a connected set of curves or edges.
intersectors ICollection<ElementId>
 Elements whose intersection with the curve references result in additional divisions.
Return Value
DividedPath
 The newly created divided path.
Exceptions
Exception | Condition
ArgumentException |  The document does not allow creation of a divided path. -or- Not all curve references in curveReferences represent a curve or an edge -or- The references in curveReferences are not connected. -or- Not all intersecting elements in intersectors are valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 Intersectors can be curve elements, datum planes, or other divided paths.
See Also
Reference
DividedPath Class
Create Overload
Autodesk.Revit.DB Namespace